[{"id":"1","nom":"Dataviz","description":"Dataviz est un site web réalisé dans le cadre d'un projet scolaire qui avait pour objectif la visualisation interactive de données sur un site web et sur le thème de notre choix. Ce projet a été réalisé en collaboration avec deux autres camarades, nous avons choisi le thème de l’implication des pays dans les missions de 1965 à 2022 en allant de 5 années en 5 années. Pour ce projet nous avons utilisé deux librairies WebGL globe pour la terre et les points dessus et D3.js pour la visualisation des pays astronautes.","image":"assets/images/projets/dataviz.jpg","url":"https://drissbenadjal.github.io/Dataviz/","github":"https://github.com/drissbenadjal/Dataviz"},{"id":"2","nom":"Discord Tools","description":"Discord Bot Tools est un logiciel que j’ai conçu pour faciliter la manipulation d’un bot discord avec plusieurs fonctionnalités. Le logiciel disponible sur ordinateur mac et pc a été réalisé avec Electron.js. Le projet a été réalisé en 5 jours sans compter les fix de bug il est open source et le logiciel est téléchargeable sur Github.","image":"assets/images/projets/discord_bot_tools.jpg","url":"","github":"https://github.com/drissbenadjal/discord-bot-tool-app"},{"id":"3","nom":"MMind Chat","description":"MMind Chat est un projet personnel c’est un logiciel de chat pour les Première et Deuxième année du B.U.T MMI. Ce projet est l’un de mes premier projet réalisé avec Electron.js. Les langages utilisés pour ce projets sont HTML, CSS, JS, PHP qui m’a permis de créer une API sécurisée pour faire communiquer la base de données et l’application, l’envoi, la réception de messages, la modification du profil et NodeJs. Pour celui-ci, j’ai aussi créé un mini site pour que les utilisateurs puissent télécharger le logiciel et créer un compte. Je vais continuer à ajouter des fonctionnalités et faire des mises à jour pour le perfectionner.","image":"assets/images/projets/mmind-chat.jpg","url":"https://benadjal.butmmi.o2switch.site/mmind-chat/","github":"https://github.com/drissbenadjal/chat-app"},{"id":"4","nom":"Blog MVC","description":"Blog MVC est un projet ou nous devions réaliser seul. un mini blog en utilisant le model conceptuel de données MVC avec le langage PHP. j’ai réalisé ce projet avec une grande aisance, j’y ai ajouté un un style qui n’a pas été imposé par la consigne pour avoir une meilleure expérience du blog. Celui-ci  est consultable via l’url ci dessus et le code est open source et consultable sur github.","image":"assets/images/projets/blog.jpg","url":"https://blog.benadjal.butmmi.o2switch.site/","github":""},{"id":"5","nom":"Infinite Travel","description":"Infinite Travel est un projet scolaire de première année de BUT consistant à réaliser et mettre en place un site de réservation. J’ai opté pour un site de réservation d’hôtels internationaux. Les consignes imposées étaient les langages HTML, CSS, JS, PHP, MY SQL, le site devait stocker les produits et être en mesure d’apporter une confirmation par mail lors de la réservation.","image":"assets/images/projets/resaweb.jpg","url":"https://resaweb.benadjal.butmmi.o2switch.site/","github":""},{"id":"6","nom":"Renov Concept","description":"Renov Concept est dans le cadre de mon stage de première année BUT . Ce fut un contrat étudiant d’un mois. Le but était de développer le site internet inexistant de l’entreprise Renov Concept en me basant sur une plaquette commerciale, mais également rechercher et développer par mes propres moyens les solutions en toute autonomie. Et dans un second temps, je voulais une première expérience dans le domaine du développement et création web. Pour ce projet, j’ai utilisé Next JS (JavaScript, CSS) et PHP pour l’APi du formulaire de contact. J’ai configuré et mis en place le site sur un VPS (serveur dédié virtuel).","image":"assets/images/projets/renovconcept.jpg","url":"http://renovconceptargenteuil.com/","github":""},{"id":"7","nom":"Commu'Niquez Bot","description":"Ce Bot discord a été réalisé dans le cadre d’un défis hackathon (La nuit de l’Info) le 2 décembre 2022 et qui avait pour consigne dès réaliser un bot discord connecter avec l’appli web pour le défi principal  qui était de réaliser un jeu interactif pour la prévention contre  le sida et les IST. J’ai donc réfléchi avec mes camarades et de mon côté,  je me suis lancé le défis de faire un bot discord qui récupère les messages des utilisateurs du discord qui taper la commande “/question [la question] et faire une petite notification sur le site qui ne dérange pas l'utilisateur. j’ai donc utilisé Node.js avec Discord.js, j’ai réalisé le bot pour récupérer les messages et les envoyer en base de données et avec express.js, j’ai réalisé un système pour envoyer les messages au site web. Les librairies utilisées sont Discord.js, Express.js. Le code source est disponible sur Github et le site est disponible ainsi que le discord pour essayer le bot.","image":"assets/images/projets/commu-niquez-bot.jpg","url":"https://meauxlotov.poisson.butmmi.o2switch.site/","github":"https://github.com/drissbenadjal/commu-niquez-botDiscord"}]